frontend/models/CatsModel.php

    public static function getAllCats()
    {
        $res = self::find()->asArray()->all();
---
SELECT * FROM `cats`