frontend/models/PostsForm.php

    public function create()
    {
        //事务处理
        $transaction = \Yii::$app->db->beginTransaction();
        try {
            $model = new PostsModel();
            $model->setAttributes($this->attributes);
            $model->summary = $this->_getSummary();
            $model->user_id = \Yii::$app->user->identity->id;
            $model->user_name = \Yii::$app->user->identity->username;
            $model->created_at = time();
            $model->updated_at = time();
            $model->is_valid = PostsModel::IS_VALID;
            if (!$model->save())
---
INSERT INTO `posts` (`title`, `content`, `label_img`, `cat_id`, `summary`, `user_id`, `user_name`, `created_at`, `updated_at`, `is_valid`) VALUES ('12333', '<p>aaaa</p>', '/image/20170905/1504572032291433.jpg', 5, 'aaaa', 560, 'shibao', 1504572403, 1504572403, 1)