frontend/models/TagForm.php

SELECT * FROM `tags` WHERE `tag_name`='标签'
INSERT INTO `tags` (`tag_name`, `post_num`) VALUES ('标签', 1)
---
    public function _saveTag($tag){
        $model = new Tags();
        $res = $model
            ->find()
            ->where(['tag_name'=>$tag])
            ->one();
        // 新建标签
        if(!$res){
            $model->tag_name=$tag;
            $model->post_num = 1;
            if(!$model->save()){